source/_posts/2014-05-18-emacs-clojure-mode使用.html
---
title: "Emacs clojure-mode使用"
date: 2014-05-18
layout: post
categories: [Clojure, Emacs]
published: true
comments: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Emacs 中使用Clojure Mode</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">基本配置</h3>
<div class="outline-text-3" id="text-1-1">
<p>
兄弟，不要折腾了，直接照抄Emacs大师Steve Purcell的配置<a href="https://github.com/purcell/emacs.d">https://github.com/purcell/emacs.d</a> <br  />
配置完之后Clojure－Mode已经配置好，附带一些其他的配置。
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">使用</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">安装leiningen <a href="https://github.com/technomancy/leiningen">https://github.com/technomancy/leiningen</a></h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
leiningen 是一个Clojure的项目管理工具。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">常用快捷键</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
M-x cider-jack-in 打开一个repl 的session，你编写的Clojure代码之后会在这里运行。<br  />
</p>

<p>
C-c C-k 编译Clojure代码，如果编译出错 C-c C-f来定位错误的地方然后修正。<br  />
</p>

<p>
C-c C-, 可以用来运行测试文件，结果会输出到打开的repl session。<br  />
</p>

<p>
C-c M-n 用来切换repl session的namespace， 如果你正在编写一个clojure文件，可以<br  />
使用这个快捷键来一边开发，一边测试。<br  />
</p>

<p>
C-c C-o 可以用来清初repl session的无用信息。<br  />
</p>

<p>
C-c C-d 可以用来查看函数的doc。<br  />
</p>

<p>
M-. 可以查看函数的源代码。<br  />
</p>

<p>
M-, 用来查看第三方库。<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">参考</h3>
<div class="outline-text-3" id="text-1-3">
<blockquote>
<p>
<a href="https://github.com/technomancy/leiningen">https://github.com/technomancy/leiningen</a> leiningen使用 <br  />
<a href="http://clojure-doc.org/articles/tutorials/emacs.html">http://clojure-doc.org/articles/tutorials/emacs.html</a> 官方教程 <br  />
</p>
</blockquote>

<p>
<!-- more -->
</p>
</div>
</div>
</div>
